typedef struct {
    int roll_main_mode; // основной режим АБСУ по крену. 0 - выкл, 1 - штурвальный - 2 - стаб
    int pitch_main_mode; // основной режим АБСУ по тангажу. 0 - выкл, 1 - штурвальный - 2 - стаб
    int roll_sub_mode; // режим АБСУ по крену. 0 - выкл, 1 - стаб, 2 - ЗК, 3 - НВУ, 4 - АЗ1, 5 - АЗ2, 6 - заход
    int pitch_sub_mode; // режим АБСУ по тангажу. 0 - выкл, 1 - стаб, 2 - V, 3 - M, 4 - H, 5 - глисс, 6 - уход
    int absu_roll_flag; // флаг директора крена
    int absu_pitch_flag; // флаг директора тангажа
    int absu_pnp_mode_1; // режим индикации ПНП. 0 = off, 1 = НВУ, 2 = VOR1, 3 = VOR2, 4 = ПС
    int absu_pnp_mode_2; // режим индикации ПНП. 0 = off, 1 = НВУ, 2 = VOR1, 3 = VOR2, 4 = ПС
    int stu_mode; // режимы автомата тяги 0 - выкл, 1 - вкл, 2 - готов, 3 стаб, 4 - уход
    int toga_comm; // режим УХОД
    int damp_roll_lamp; // сигнал на лампочку. отказ демпера крена
    int damp_pitch_lamp; // сигнал на лампочку. отказ демпера тангажа
    int damp_yaw_lamp; // сигнал на лампочку. отказ демпера курса
    int roll_contr_lamp; // сигнал на лампочку. отказ управления крена
    int pitch_contr_lamp; // сигнал на лампочку. отказ управления тангажа
    int man_roll_lamp; // сигнал на лампочку. управляй креном
    int man_pitch_lamp; // сигнал на лампочку. управляй тангажом
    int man_toga_lamp; // сигнал на лампочку. управляй уходом
    int triangle_lamp_signal; // сигнал на лампочку. треугольник
    int absu_fail_signal; // сигнал на сирену
    int absu_pitch_trimm; // комманда триммеру от АБСУ. +1 = вверх, -1 = ввениз
    
    float contr_pitch; // отклонение штока РА56 по тангажу
    float contr_roll; // отклонение штока РА56 по крену
    float contr_yaw; // отклонение штока РА56 по направлению
    
    float rud_1_spd; // скорость изменения положения рычага
    float rud_2_spd; // скорость изменения положения рычага
    float rud_3_spd; // скорость изменения положения рычага
    float absu_roll_ind; // индикация директора крена
    float absu_pitch_ind; // индикация директора тангажа
    
} absu_t;