typedef struct {

    int show_gns; // в самолете установлена GNS430 вместо KLN
    int RXP; // в системе установлена RXP
    int show_yokes; // видны ли штурвалы
    int show_chairs; // видны ли кресла
    int table_up_L; // поднять столики
    int table_up_R; // поднять столики
    int gpu_present; // РАП присутствует
    int gear_blocks; // установка блоков шасси
    int sensors_caps; // установка крышек датчиков
    int engine_caps; // установка крышек двигателей
    int ladder_1_call; // трап. 1 подъехать,0 - уехать
    int ladder_2_call; // трап
    int catering_call; // кухни
    int fuel_tanker_call; // заправщик
    
    float rain_glass_1; // светимость маски с дождем на стекле
    float rain_glass_2; // светимость маски с дождем на стекле
    float rain_glass_1_w_1_L; // светимость маски с дождем на левом стекле сектор 1
    float rain_glass_1_w_2_L; // светимость маски с дождем на левом стекле сектор 2
    float rain_glass_1_w_3_L; // светимость маски с дождем на левом стекле сектор 3
    float rain_glass_1_w_4_L; // светимость маски с дождем на левом стекле сектор 4
    float rain_glass_1_w_5_L; // светимость маски с дождем на левом стекле сектор 5
    float rain_glass_2_w_1_L; // светимость маски с дождем на левом стекле сектор 1
    float rain_glass_2_w_2_L; // светимость маски с дождем на левом стекле сектор 2
    float rain_glass_2_w_3_L; // светимость маски с дождем на левом стекле сектор 3
    float rain_glass_2_w_4_L; // светимость маски с дождем на левом стекле сектор 4
    float rain_glass_2_w_5_L; // светимость маски с дождем на левом стекле сектор 5
    float rain_glass_1_w_1_R; // светимость маски с дождем на левом стекле сектор 1
    float rain_glass_1_w_2_R; // светимость маски с дождем на левом стекле сектор 2
    float rain_glass_1_w_3_R; // светимость маски с дождем на левом стекле сектор 3
    float rain_glass_1_w_4_R; // светимость маски с дождем на левом стекле сектор 4
    float rain_glass_1_w_5_R; // светимость маски с дождем на левом стекле сектор 5
    float rain_glass_2_w_1_R; // светимость маски с дождем на левом стекле сектор 1
    float rain_glass_2_w_2_R; // светимость маски с дождем на левом стекле сектор 2
    float rain_glass_2_w_3_R; // светимость маски с дождем на левом стекле сектор 3
    float rain_glass_2_w_4_R; // светимость маски с дождем на левом стекле сектор 4
    float rain_glass_2_w_5_R; // светимость маски с дождем на левом стекле сектор 5
    float net_rain_ratio; // актуальное количество осадков на стеклах
    float cargo_1; // положение багажной двери 1. 0 - закрыта, 1 - открыта
    float cargo_2; // положение багажной двери 2. 0 - закрыта, 1 - открыта
    float apu_doors; // положение створок ВСУ. 0 - закрыты, 1 - открыты.
    float pax_door_1; // положение передних пасс дверей
    float pax_door_2; // положение средних пасс дверей
    float pax_door_3; // положение правых аварийных дверей
    float lg_front_pos; // положение передней стойки шасси
    float lg_front_defl; // просадка аммортизатора передней стойки
    float lg_front_turn; // поворот передней стойки шасси
    float lg_main_pos_left; // положение левой основной стойки. 0-1 - выпуск, 1+ - просадка аммортизатора
    float lg_main_rot_left; // поворот левой тележки на земле
    float lg_main_pos_right; // положение правой основной стойки. 0-1 - выпуск, 1+ - просадка аммортизатора
    float lg_main_rot_right; // поворот правой тележки на земле
    float light_open_left; // выпуск левой фары
    float light_open_right; // выпуск правой фары
    float spd_brk_inn_left; // положение левого внутреннего спидбрейка
    float spd_brk_inn_right; // положение правого внутреннего спидбрейка
    float wing_flx_left; // угол изгиба левого крыла. положительные значения - изгиб вверх
    float wing_flx_right; // угол изгиба правого крыла. положительные значения - изгиб вверх
    float rudder_anim; // угол поворота руля направления для анимации. его физичческая модель будет поворачиваться на меньший угол при реверсе.
    float elev_anim_L; // угол поворота руля высоты
    float elev_anim_R; // угол поворота руля высоты
    float cockpit_door; // открывание двери в кабину
    float cockpit_table_1; // столики на сидениях пилотов
    float cockpit_table_2; // столики на сидениях пилотов
    float cockpit_vent_1; // угол поворота вентиляторов
    float cockpit_vent_2; // угол поворота вентиляторов
    float cockpit_vent_3; // угол поворота вентиляторов
    float cockpit_window_left; // открытие форточки
    float cockpit_window_right; // открытие форточки
    float rise_chair_arm_L; // поднять ручку кресла
    float rise_chair_arm_R; // поднять ручку кресла
    float gpu_work; // РАП работает. поднятие крышки выхлопа
    float ground_stuff_angle; // коррекция угла по тангажу для техники
    float window_ice_1; // уровень льда на стеклах
    float window_ice_2; // уровень льда на стеклах
    float window_ice_3; // уровень льда на стеклах
    float window_ice_4; // уровень льда на остальных стеклах
    float ladder_1; // трап. 500 - скрыт. +50..0 - подъезжает, 0 - стоит возле замолета, 0..-50 - уезжает
    float ladder_2; // трап
    float catering; // кухни
    float fuel_tanker; // заправщик
    float reverse_mid; // положение общего манипулятора реверса
    float wiper_angle_left; // угол поворота стеклоочистителя от края. 0 - 62
    float wiper_angle_right; // угол поворота стеклоочистителя от края. 0 - 

} anim_t;