typedef struct {

    int side; // какую сторону показывать. 0 - пред взлетом, 1 - перед заходом
    int fishka_1; // положение фишки. 0 - слева, 1 - справа
    int fishka_2; // положение фишки. 0 - слева, 1 - справа
    int fishka_3; // положение фишки. 0 - слева, 1 - справа
    int fishka_4; // положение фишки. 0 - слева, 1 - справа
    int fishka_5; // положение фишки. 0 - слева, 1 - справа
    int fishka_6; // положение фишки. 0 - слева, 1 - справа
    int fishka_7; // положение фишки. 0 - слева, 1 - справа
    int fishka_8; // положение фишки. 0 - слева, 1 - справа
    int fishka_9; // положение фишки. 0 - слева, 1 - справа
    int fishka_10; // положение фишки. 0 - слева, 1 - справа
    int fishka_11; // положение фишки. 0 - слева, 1 - справа
    int fishka_12; // положение фишки. 0 - слева, 1 - справа
    int fishka_13; // положение фишки. 0 - слева, 1 - справа
    int fishka_14; // положение фишки. 0 - слева, 1 - справа
    int fishka_15; // положение фишки. 0 - слева, 1 - справа
    int fishka_16; // положение фишки. 0 - слева, 1 - справа
    int fishka_17; // положение фишки. 0 - слева, 1 - справа
    int fishka_18; // положение фишки. 0 - слева, 1 - справа
    int fishka_19; // положение фишки. 0 - слева, 1 - справа
    int fishka_20; // положение фишки. 0 - слева, 1 - справа
    int checklist_selected; // выбор чеклиста.
    int to_ready; // лампа горит

} checklist_t;